---
kind: enumMember
id: F:Autodesk.Revit.UI.PostableCommand.VoidExtrusion
enum: Autodesk.Revit.UI.PostableCommand
source: html/f6ccdc1b-6ac3-9c49-d0bb-8a7d1877eab0.htm
---
# Autodesk.Revit.UI.PostableCommand.VoidExtrusion

Creates a 3D shape that is then used to remove part of a solid 3D shape.